let text = `але я знала, що мене колись теж не стане і ніхто не пам’ята-тиме, що я взагалі жила на світі. Світ забуде. Піде далі, звіль-нившись від тих, хто був раніше, скинувши із себе старе заради нового. Трагізм усього цього був для мене нестерп-ний — трагізм того, що життя починається і закінчується, але ніхто цього не пам’ятає.

Оїн народився у графстві Літрім 1915 року, за дев’ять місяців до уславленого Великоднього повстання, що назавж-ди змінило Ірландію 1. Його батьки (мої прабабуся та праді-дусь) загинули під час того повстання, й Оїн осиротів, не знавши жодного з них. Цим ми з дідом були подібні: обоє осиротіли малими; його втрата увірвалася в мою, моя втра-та стала його. Мої батьки померли, коли мені було всього шість років. Я була маленькою дівчинкою з неповоротким язиком і надміру активною уявою, й Оїн увійшов у моє жит-тя, врятував мене й виростив.

Бувало, коли я силкувалася щось сказати, дідусь давав мені ручку й папір. «Якщо не можеш вимовити, запиши. Так слова проіснують довше. Записуй усі свої слова, Енні. Запи-суй і відсилай їх кудись».

Так я й робила.

Та ця історія не схожа на жодну з тих, які я бодай колись розповідала, на жодну з тих, які я написала. Це історія моєї родини, вплетена у тканину минулого, вирізьблена в моїй ДНК й навіки закарбована в пам’яті. Усе це почалось — якщо це має початок — тоді, коли Оїн помирав..`

let name = `Artem`

let replaceArtem = text.replaceAll (` `, name);

console.log (replaceArtem)
